Autodesk.Revit.DB.SketchEditScope.IsSketchEditingSupported(Autodesk.Revit.DB.ElementId)
Checks whether sketch can be edited.
sketchId:
The element id of sketch.
Returns:
True if sketch can be edited, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.SketchEditScope.Start(Autodesk.Revit.DB.ElementId)
Starts a sketch edit mode.
Remarks:
The application will need to start a transaction to actually make changes to the Sketch element.
SketchEditScope can only be started when there is no transaction active, thus it does not
work for commands running in automatic transaction mode.
Like all Start methods in any edit scope object this too returns an Id of the element in the edit session,
even though in this case here it always equals to the given sketchId.
sketchId:
The Sketch element to be edited.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId sketchId does not represent a Sketch.
-or-
Sketch does not support editing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This SketchEditScope is not permitted to start at this moment for one of the following possible reasons:
The document is in read-only state, or the document is currently modifiable,
or there already is another edit mode active in the document.
Since:
2022